# PROGETTO TEAM 24
Christan Internò 876238, Davide Miori 813692, Francesco Oliviero 812292

In [1]:
import pandas as pd
import re

### 0. Preprocessing

Importo i tre datatset e verifico la presenza di missing values

In [2]:
cwur = pd.read_csv("cwurData.csv")
cwur.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

Modifico il nome della colonna Institution del dataset cwur in university_name al fine di renderlo compatibile agli altri due

In [3]:
cwur.rename(columns={'institution':'university_name'}, inplace=True)
cwur.head()

,world_rank,university_name,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

Noto che i missing sono presenti solo in una variabile che per il momento non è interessante quindi non li rimuovo

In [4]:
cwur.isnull().sum()

world_rank                0
university_name           0
country                   0
national_rank             0
quality_of_education      0
alumni_employment         0
quality_of_faculty        0
publications              0
influence                 0
citations                 0
broad_impact            200
patents                   0
score                     0
year                      0
dtype: int64

In [5]:
times = pd.read_csv("timesData.csv")
times.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,-,94.2,"7,929",8.4,27%,45 : 55,2011

Diverse colonne con missing che al momento non sono importanti perciò non rimuovo nulla

In [6]:
times.isnull().sum()

world_rank                  0
university_name             0
country                     0
teaching                    0
international               0
research                    0
citations                   0
income                      0
total_score                 0
num_students               59
student_staff_ratio        59
international_students     67
female_male_ratio         233
year                        0
dtype: int64

In [7]:
shanghai = pd.read_csv("shanghaiData.csv")
shanghai.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
0,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005
1,2,University of Cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005
2,3,Stanford University,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005
3,4,"University of California, Berkeley",3,72.8,71.8,76.0,69.4,73.9,72.2,52.7,2005
4,5,Massachusetts Institute of Technology (MIT),4,70.1,74.0,80.6,66.7,65.8,64.3,53.0,2005

In [8]:
shanghai.isnull().sum()

world_rank            0
university_name       1
national_rank         1
total_score        3796
alumni                1
award                 2
hici                  2
ns                   22
pub                   2
pcp                   2
year                  0
dtype: int64

Rimuovo la riga non presentante il nome dell'università poichè inutile per la risoluzione dei primi punti

In [9]:
shanghai[shanghai['university_name'].isnull()==True]

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
3896,99,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2013

Verifico che la rimozione abbia avuto buon fine

In [10]:
shanghai.drop([3896],inplace = True)

In [11]:
shanghai[shanghai['university_name'].isnull()==True]

Empty DataFrame
Columns: [world_rank, university_name, national_rank, total_score, alumni, award, hici, ns, pub, pcp, year]
Index: []

Resetto l'index

In [12]:
shanghai.reset_index(drop=True,inplace=True)

### 1. For each university, extract from the *times* dataset the most recent and the least recent data, obtaining two separate dataframes

Seleziono prima l'anno minore poi quello maggiore dove aver raggruppato per il nome delle università

In [13]:
times_min = times.iloc[times.groupby('university_name')['year'].idxmin()]
times_min.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",17.0,1%,-,2016
501,301-350,Aalborg University,Denmark,19.0,75.3,20.0,27.1,36.4,-,"17,422",15.9,15%,48 : 52,2012
502,301-350,Aalto University,Finland,26.2,49.0,22.2,37.5,61.9,-,"16,099",24.2,17%,32 : 68,2012
166,167,Aarhus University,Denmark,38.1,33.4,55.6,57.3,61.5,49.9,"23,895",13.6,14%,54 : 46,2011
476,276-300,Aberystwyth University,United Kingdom,19.8,63.8,15.5,56.6,35.5,-,"9,252",19.2,18%,48 : 52,2012

In [14]:
times_max = times.iloc[times.groupby('university_name')['year'].idxmax()]
times_max.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",17.0,1%,-,2016
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016

### 2. For each university, compute the improvement in `income` between the least recent and the most recent data points

Osservo che la colonna income presenta dei valori anomali

In [15]:
times_max[times_max['income'].str.contains('-')]

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",17.0,1%,-,2016
2303,501-600,American University of Beirut,Lebanon,27.7,93.0,11.2,31.9,-,-,"7,695",8.9,25%,51 : 49,2016
2312,501-600,Blaise Pascal University,France,20.2,66.6,2.9,46.9,-,-,"15,619",7.1,17%,55 : 45,2016
2432,601-800,"California State University, Long Beach",United States of America,11.6,18.9,10.4,23.3,-,-,"29,594",32.3,5%,58 : 42,2016
1817,15,Columbia University,United States of America,85.9,73.5,82.2,98.1,-,86.1,"25,055",5.9,28%,NaN,2016
2462,601-800,Federal University of Bahia,Brazil,18.2,19.7,8.1,14.3,-,-,"39,861",17.9,1%,47 : 53,2016
2469,601-800,Federal University of Lavras,Brazil,25.8,14.5,16.4,3.0,-,-,"10,350",20.9,2%,53 : 47,2016
2464,601-800,Federal University of Paraná (UFPR),Brazil,24.6,15.5,9.6,7.0,-,-,"21,850",11.2,1%,NaN,2016
2465,601-800,Federal University of Rio Grande do Sul,Brazil,32.6,18.9,13.7,16.8,-,-,"38,743",14.8,1%,50 : 50,2016
2467,601-800,Federal University of São Carlos,Brazil,29.0,16.8,10.8,11.5,-,-,"18,587",16.9,0%,NaN,2016
1230,226-250,Georgia Health Sciences University,United States of America,47.2,30.8,12.1,63.5,-,-,NaN,NaN,NaN,NaN,2014
2236,401-500,Howard University,United States of America,38.8,30.3,11.0,44.5,-,-,"10,297",6.8,5%,65 : 35,2016
1713,301-350,Illinois Institute of Technology,United States of America,40.2,59.4,17.3,50.3,-,-,NaN,NaN,NaN,NaN,2015
2022,201-250,Indiana University,United States of America,43.0,41.2,27.3,74.8,-,-,"62,468",13.6,13%,53 : 47,2016
2251,401-500,Louisiana State University,United States of America,26.8,26.1,27.7,37.8,-,-,"28,116",20.1,6%,52 : 48,2016
2508,601-800,Middlesex University,United Kingdom,18.5,81.0,10.6,25.7,-,-,"17,753",24.7,44%,59 : 41,2016
2511,601-800,Nagasaki University,Japan,22.8,21.9,10.8,14.3,-,-,"9,137",7.2,4%,36 : 64,2016
2258,401-500,National and Kapodistrian University of Athens,Greece,26.7,39.0,16.3,45.8,-,-,"63,052",32.3,9%,61 : 39,2016
1373,351-400,Old Dominion University,United States of America,21.3,30.2,14.3,58.7,-,-,NaN,NaN,NaN,NaN,2014
1918,=113,Purdue University,United States of America,50.2,66.4,57.7,63.2,-,57.0,"39,256",18.1,22%,42 : 58,2016
2379,501-600,Quaid-i-azam University,Pakistan,17.9,35.4,9.9,45.6,-,-,"12,688",25.7,0%,53 : 47,2016
2556,601-800,Showa University,Japan,28.5,14.0,7.9,7.0,-,-,"3,675",2.5,0%,57 : 43,2016
974,351-400,Southern Methodist University,United States of America,18.6,35.2,9.0,67.3,-,-,NaN,NaN,NaN,NaN,2013
2566,601-800,Suez Canal University,Egypt,22.6,31.6,5.9,16.0,-,-,"16,817",6.0,NaN,65 : 35,2016
2575,601-800,Texas Tech University,United States of America,27.9,36.8,17.2,22.0,-,-,"29,512",20.9,7%,46 : 54,2016
1896,=94,University of Bonn,Germany,45.1,63.6,47.5,85.3,-,58.8,"32,474",70.4,13%,55 : 45,2016
2426,601-800,University of Brasília,Brazil,21.9,24.1,7.4,10.4,-,-,"45,880",14.5,2%,52 : 48,2016
2314,501-600,University of Burgundy,France,21.4,50.9,8.8,46.3,-,-,"26,612",20.8,11%,54 : 46,2016
2319,501-600,University of Chile,Chile,28.3,44.1,19.6,30.5,-,-,"29,207",14.2,3%,47 : 53,2016
2454,601-800,University of Debrecen,Hungary,17.3,49.0,11.4,20.9,-,-,"29,714",20.3,13%,57 : 43,2016
2456,601-800,University of Dhaka,Bangladesh,21.7,37.2,7.2,9.6,-,-,"62,716",6.9,5%,34 : 66,2016
1925,=120,University of Florida,United States of America,51.8,33.3,56.8,67.7,-,56.1,"50,095",18.7,9%,54 : 46,2016
2474,601-800,University of Ghana,Ghana,15.6,48.4,15.6,19.5,-,-,"37,274",37.5,2%,41 : 59,2016
934,301-350,University of Kentucky,United States of America,39.1,21.7,27.8,45.5,-,-,NaN,NaN,NaN,NaN,2013
2026,201-250,University of Kiel,Germany,32.3,49.4,20.5,89.5,-,-,"24,444",23.8,8%,53 : 47,2016
2257,401-500,University of Nantes,France,19.6,35.1,12.2,69.4,-,-,"33,866",22.2,11%,56 : 44,2016
2263,401-500,University of Neuchâtel,Switzerland,24.2,91.4,14.7,48.2,-,-,"4,358",8.5,22%,59 : 41,2016
2573,601-800,University of Tehran,Iran,26.1,16.5,16.9,15.8,-,-,"53,802",27.0,1%,45 : 55,2016
2574,601-800,University of Texas at El Paso,United States of America,18.6,30.4,18.7,18.4,-,-,"19,123",29.0,7%,54 : 46,2016
1795,351-400,University of Vermont,United States of America,26.8,21.0,19.4,57.5,-,-,NaN,NaN,NaN,NaN,2015
45,43,University of Wisconsin,United States of America,55.5,43.7,64.6,83.4,-,67.0,NaN,NaN,NaN,NaN,2011
2595,601-800,West University of Timişoara,Romania,16.1,21.0,3.9,22.4,-,-,"12,933",19.0,3%,62 : 38,2016
2302,401-500,Xiamen University,China,26.7,25.0,15.6,47.0,-,-,"32,921",12.3,5%,52 : 48,2016
1968,=164,Yeshiva University,United States of America,44.8,28.5,23.7,92.8,-,51.2,"6,753",5.5,7%,53 : 47,2016

Considero solo le righe che non contengono nella variabile income il simbolo '-'

In [16]:
times_max_rm = times_max[times_max['income'].str.contains('-')==False][['university_name','income','year']]

In [17]:
times_min_rm = times_min[times_min['income'].str.contains('-')==False][['university_name','income','year']]

Prima di operare la sottrazione converto i valori di income in numerici 'float'.

In [18]:
times_max_rm['income'] = times_max_rm['income'].astype(float)
times_min_rm['income'] = times_min_rm['income'].astype(float)
times_max_rm.head()

                 university_name  income  year
2003          Aalborg University    43.7  2016
2056            Aalto University    61.6  2016
1908           Aarhus University    68.3  2016
2105      Aberystwyth University    31.3  2016
2404  Adam Mickiewicz University    28.7  2016

Verifico che la conversione sia andata a buon fine

In [19]:
times_max_rm.dtypes

university_name     object
income             float64
year                 int64
dtype: object

Uniamo i due dataset  per mezzo della colonna delle università selezionando solo le colonne desiderate

In [20]:
merged = pd.merge(times_max_rm, times_min_rm, on='university_name', suffixes = ['_mostrecent', '_leastrecent'])
merged.head()

,university_name,income_mostrecent,year_mostrecent,income_leastrecent,year_leastrecent
0,Aalborg University,43.7,2016,36.4,2012
1,Aalto University,61.6,2016,61.9,2012
2,Aarhus University,68.3,2016,61.5,2011
3,Aberystwyth University,31.3,2016,35.5,2012
4,Adam Mickiewicz University,28.7,2016,28.7,2016

Effettuo la differenza tra l'income dell'anno più recente rispetto a quello più remoto.

In [21]:
merged['difference'] = merged['income_mostrecent'] - merged['income_leastrecent']
merged.head()

,university_name,income_mostrecent,year_mostrecent,income_leastrecent,year_leastrecent,difference
0,Aalborg University,43.7,2016,36.4,2012,7.3
1,Aalto University,61.6,2016,61.9,2012,-0.3
2,Aarhus University,68.3,2016,61.5,2011,6.8
3,Aberystwyth University,31.3,2016,35.5,2012,-4.2
4,Adam Mickiewicz University,28.7,2016,28.7,2016,0.0

### 3. Find the university with the largest increase computed in the previous point

Ordino le righe di merged rispettivamente alla differenza in senso decrescente.

In [22]:
merged.sort_values(by='difference', ascending=False)

,university_name,income_mostrecent,year_mostrecent,income_leastrecent,year_leastrecent,difference
373,TU Dresden,99.7,2016,31.9,2012,67.8
238,Nanyang Technological University,99.9,2016,40.0,2011,59.9
198,LMU Munich,100.0,2016,40.4,2011,59.6
173,Karlsruhe Institute of Technology,99.5,2016,40.0,2011,59.5
236,Nagoya University,91.4,2016,33.1,2012,58.3
...,...,...,...,...,...,...
380,Technical University of Denmark,50.0,2016,95.5,2011,-45.5
508,University of Iceland,28.0,2016,75.4,2012,-47.4
205,Leiden University,49.8,2016,100.0,2011,-50.2
430,University of Arizona,32.4,2016,84.2,2011,-51.8
361,State University of New York Albany,28.0,2016,92.9,2012,-64.9

### 4. For each ranking, consider only the most recent data point. For each university, compute the maximum difference between the rankings (e.g. for *Aarhus University* the value is 122-73=49). Notice that some rankings are expressed as a range

Noto che nella colonna world_rank di Times sono presenti degli '='.

In [24]:
times[times['world_rank'].str.contains('=')==True]['world_rank'].head()

1841    =39
1842    =39
1846    =44
1847    =44
1849    =47
Name: world_rank, dtype: object

Rimuovo il simbolo '=' sostituendolo con uno spazio vuoto.

In [25]:
times['world_rank_norm']=times['world_rank'].str.replace('=','')

Verifico di aver rimosso correttamente.

In [26]:
times[times['world_rank_norm'].str.contains('=')==True]['world_rank_norm'].head()

Series([], Name: world_rank_norm, dtype: object)

Noto che sia il dataset shanghai sia times hanno un range di valori nel world_rank come anticipato dalla consegna. Decido dunque di considerare il valore medio ai fini dell'analisi.

In [27]:
times['world_rank']

0             1
1             2
2             3
3             4
4             5
         ...
2598    601-800
2599    601-800
2600    601-800
2601    601-800
2602    601-800
Name: world_rank, Length: 2603, dtype: object

Definisco la funzione per cacolare tale valore medio.

In [28]:
def mean_calculator(valore):
    if len(valore)==7:
        
        pattern = re.compile("(\d+)\-(\d+)")
        occurrence = pattern.search(valore)
        
        if occurrence:
            primo = int(occurrence.group(1))
            secondo = int(occurrence.group(2))
            media = (primo + secondo) / 2
            return int(media)
        
    if len(valore) != 7:
        return int(valore)

Applico la funzione alle colonne dei due dataset sopra citati.

In [29]:
times['world_rank_norm'] = times['world_rank_norm'].apply(mean_calculator)

Verifico che la media sia stata calcolata correttamente

In [30]:
times.loc[1764]

world_rank                                              351-400
university_name           Indian Institute of Technology Bombay
country                                                   India
teaching                                                   34.2
international                                              19.5
research                                                   24.6
citations                                                  43.5
income                                                     49.7
total_score                                                   -
num_students                                              8,327
student_staff_ratio                                        14.9
international_students                                       1%
female_male_ratio                                       16 : 84
year                                                       2015
world_rank_norm                                             375
Name: 1764, dtype: object

Applico la funzione anche a shanghai.

In [31]:
shanghai['world_rank_norm'] = shanghai['world_rank'].apply(mean_calculator)

In [32]:
shanghai.loc[1981]

world_rank                        402-503
university_name    University of Hannover
national_rank                       36-40
total_score                           NaN
alumni                                  0
award                                   0
hici                                  7.3
ns                                    6.2
pub                                    25
pcp                                  12.3
year                                 2008
world_rank_norm                       452
Name: 1981, dtype: object

Seleziono gli anni più recenti per i tre dataset.

In [33]:
cwur_ranking = cwur.iloc[cwur.groupby('university_name')['year'].idxmax()].copy()
cwur_ranking.head()

,world_rank,university_name,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
1981,782,AGH University of Science and Technology,Poland,4,267,279,218,708,891,511,896.0,398,44.26,2015
1764,565,Aalborg University,Denmark,5,367,439,218,596,660,287,520.0,401,44.59,2015
1620,421,Aalto University,Finland,4,367,224,218,336,403,645,424.0,246,45.10,2015
1321,122,Aarhus University,Denmark,2,310,165,106,91,81,101,95.0,154,49.65,2015
2013,814,Aberystwyth University,United Kingdom,59,367,567,218,842,552,511,754.0,607,44.22,2015

In [34]:
shanghai_ranking = shanghai.iloc[shanghai.groupby('university_name')['year'].idxmax()].copy()
shanghai_ranking.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,world_rank_norm
4696,301-400,Aalborg University,5,NaN,0.0,0.0,11.2,4.6,30.4,16.8,2015,350
4796,401-500,Aalto University,4-6,NaN,0.0,0.0,0.0,10.4,33.4,17.0,2015,450
4468,73,Aarhus University,2,27.3,11.5,22.1,12.3,25.8,51.8,31.0,2015,73
4496,101-150,Aix Marseille University,5-6,NaN,13.6,0.0,15.2,20.3,50.1,27.6,2015,125
3115,102-150,Aix-Marseille University,4-6,NaN,15.6,0.0,16.1,22.4,44.3,15.3,2011,126

In [35]:
times_ranking = times.iloc[times.groupby('university_name')['year'].idxmax()].copy()
times_ranking.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,world_rank_norm
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",17.0,1%,-,2016,700
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016,225
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016,275
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016,106
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016,325

Importo il dataset school_and_country poichè contiene i nomi normalizzati delle università per paese.

In [36]:
school = pd.read_csv('school_and_country_table.csv')
school.head()

                             school_name                   country
0                     Harvard University  United States of America
1     California Institute of Technology  United States of America
2  Massachusetts Institute of Technology  United States of America
3                    Stanford University  United States of America
4                   Princeton University  United States of America

Scrivo una funzione base per normalizzare i nomi delle università

In [37]:
def norm_function (value):
    
    for university in school['school_name']:
        if value == university:
            return value
        
    pattern = re.compile(value)
    for university in school['school_name']:
        occurrence = pattern.search(university)
        if occurrence:
            return university
        else:
            pattern2 = re.compile(university)
            occurrence2 =pattern2.search(value)
            if occurrence2:
                return university

Applico la funzione a shanghai.

In [38]:
shanghai_ranking['school_name'] = shanghai_ranking['university_name'].apply(norm_function)

Verifico se si sono generati dei doppioni.

In [39]:
shanghai_ranking[(shanghai_ranking['school_name'].isnull()==False) & (shanghai_ranking['school_name'].duplicated()==True)]

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,world_rank_norm,school_name
3876,79,Arizona State University - Tempe,46.0,26.1,0.0,20.1,27.1,27.5,42.5,18.9,2013,79,Arizona State University
3425,401-500,Curtin University of Technology,14-19,NaN,0.0,0.0,0.0,10.5,29.4,16.3,2011,450,Curtin University
925,401-500,Louisiana State University Health Sciences Center,141-167,NaN,0.0,0.0,7.7,0.0,31.0,14.6,2006,450,Louisiana State University
4509,101-150,Norwegian University of Science and Technology...,2,NaN,13.6,21.0,10.1,12.9,36.4,20.0,2015,125,Norwegian University of Science and Technology
4457,61,Purdue University - West Lafayette,37,29.2,13.6,23.1,27.7,25.1,49.0,22.4,2015,61,Purdue University
4132,201-300,Royal Institute of Technology,6-8,NaN,0.0,14.9,3.6,9.9,38.0,23.5,2014,250,KTH Royal Institute of Technology
3606,93,Texas A&M University - College Station,51,24.6,0.0,0.0,33.9,22.5,53.2,19.2,2012,93,Texas A&M University
3912,17,The Johns Hopkins University,15,47.0,38.7,33.6,44.0,47.8,70.2,28.7,2014,17,Johns Hopkins University
3461,401-500,The University of Connecticut Health Center,138-151,NaN,0.0,0.0,10.2,7.4,21.7,11.6,2011,450,University of Connecticut
4568,151-200,The University of Hong Kong,1-2,NaN,0.0,0.0,17.5,14.2,43.9,22.5,2015,175,University of Hong Kong
4853,401-500,University of Arkansas at Little Rock,126-146,NaN,0.0,0.0,10.7,2.1,24.4,19.9,2015,450,University of Arkansas
3383,301-400,University of Bordeaux 1,14-17,NaN,0.0,0.0,12.5,14.7,23.8,14.1,2011,350,University of Bordeaux
4763,301-400,University of Campinas,2-4,NaN,0.0,0.0,3.6,2.9,41.2,20.2,2015,350,State University of Campinas
4767,301-400,University of Connecticut,103-125,NaN,11.5,0.0,8.0,8.6,35.0,13.4,2015,350,University of Connecticut
4863,401-500,University of Graz,4-6,NaN,7.3,9.4,0.0,6.2,19.9,17.0,2015,450,University of Graz
4663,201-300,University of Innsbruck,2-3,NaN,0.0,9.4,14.8,18.6,24.1,25.2,2015,250,University of Innsbruck
3783,201-300,University of Kansas - Lawrence,86-109,NaN,12.1,0.0,12.5,9.9,40.0,13.8,2012,250,University of Kansas
2984,401-500,University of Kansas Medical Center,138-154,NaN,0.0,0.0,12.5,6.0,20.2,10.7,2010,450,University of Kansas
4871,401-500,"University of Maryland, Baltimore County",126-146,NaN,0.0,0.0,17.4,6.5,17.8,17.3,2015,450,"University of Maryland, Baltimore County"
4533,101-150,University of Massachusetts Medical School - W...,52-65,NaN,0.0,20.0,15.9,24.9,27.4,23.9,2015,125,University of Massachusetts
3853,54,University of Melbourne,1.0,30.2,17.7,13.4,24.0,24.4,62.5,27.1,2013,54,University of Melbourne
4417,22,University of Michigan-Ann Arbor,17,41.7,34.4,0.0,56.2,41.3,75.9,25.6,2015,22,University of Michigan
4872,401-500,University of Milan - Bicocca,11-20,NaN,0.0,0.0,5.0,5.6,30.9,21.4,2015,450,University of Milan
4775,301-400,University of Montana - Missoula,103-125,NaN,5.1,0.0,15.9,13.9,17.5,17.8,2015,350,University of Montana
3654,101-150,University of New South Wales,6-7,NaN,0.0,0.0,20.4,14.2,53.5,20.8,2012,125,University of New South Wales
4274,301-400,University of Newcastle,10-18,NaN,0.0,0.0,11.1,7.1,31.4,21.3,2014,350,University of Newcastle
4465,70,"University of Pittsburgh, Pittsburgh Campus",41,28.1,18.5,0.0,39.8,19.2,59.6,18.3,2015,70,University of Pittsburgh
3960,65,University of Pittsburgh-Pittsburgh Campus,41,28.6,19.0,0.0,39.8,19.2,61.9,18.5,2014,65,University of Pittsburgh
3501,401-500,University of Wisconsin - Milwaukee,138-151,NaN,11.8,0.0,0.0,6.8,25.7,12.6,2011,450,University of Wisconsin
3309,201-300,Washington State University - Pullman,90-110,NaN,0.0,0.0,20.4,12.8,31.8,16.1,2011,250,Washington State University

In [40]:
a = shanghai_ranking.groupby('school_name').size()
a[a>1]

school_name
Arizona State University                          2
Curtin University                                 2
Johns Hopkins University                          2
KTH Royal Institute of Technology                 2
Louisiana State University                        2
Norwegian University of Science and Technology    2
Purdue University                                 2
State University of Campinas                      2
Texas A&M University                              2
University of Arkansas                            2
University of Bordeaux                            2
University of Connecticut                         3
University of Graz                                2
University of Hong Kong                           2
University of Innsbruck                           2
University of Kansas                              3
University of Maryland, Baltimore County          2
University of Massachusetts                       2
University of Melbourne                           2
University of Michigan                            2
University of Milan                               2
University of Montana                             2
University of New South Wales                     2
University of Newcastle                           2
University of Pittsburgh                          3
University of Wisconsin                           2
Washington State University                       2
dtype: int64

In [41]:
shanghai_ranking[shanghai_ranking['school_name']=='Curtin University']

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,world_rank_norm,school_name
4605,201-300,Curtin University,9-11,NaN,0.0,0.0,8.7,12.0,37.1,23.3,2015,250,Curtin University
3425,401-500,Curtin University of Technology,14-19,NaN,0.0,0.0,0.0,10.5,29.4,16.3,2011,450,Curtin University

In [43]:
shanghai_ranking[shanghai_ranking['school_name']=='University of Arkansas']

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,world_rank_norm,school_name
4852,401-500,University of Arkansas at Fayetteville,126-146,NaN,0.0,0.0,12.2,6.1,24.4,14.1,2015,450,University of Arkansas
4853,401-500,University of Arkansas at Little Rock,126-146,NaN,0.0,0.0,10.7,2.1,24.4,19.9,2015,450,University of Arkansas

In [44]:
shanghai_ranking[shanghai_ranking['school_name']=='University of Milan']

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,world_rank_norm,school_name
4584,151-200,University of Milan,1-5,NaN,17.0,0.0,14.2,9.6,46.3,21.2,2015,175,University of Milan
4872,401-500,University of Milan - Bicocca,11-20,NaN,0.0,0.0,5.0,5.6,30.9,21.4,2015,450,University of Milan

In [45]:
shanghai_ranking[shanghai_ranking['school_name']=='University of Wisconsin']

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,world_rank_norm,school_name
4419,24,University of Wisconsin - Madison,18,41.1,30.8,34.8,40.2,35.7,62.5,24.6,2015,24,University of Wisconsin
3501,401-500,University of Wisconsin - Milwaukee,138-151,NaN,11.8,0.0,0.0,6.8,25.7,12.6,2011,450,University of Wisconsin

In [46]:
school[school['school_name']=='University of Wisconsin-Milwaukee']

                           school_name                   country
630  University of Wisconsin-Milwaukee  United States of America

Rimuovo la colonna normalizzata.

In [47]:
del shanghai_ranking['school_name']

Verifico di averla rimossa

In [48]:
shanghai_ranking.head(1)

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,world_rank_norm
4696,301-400,Aalborg University,5,NaN,0.0,0.0,11.2,4.6,30.4,16.8,2015,350

Rimuovo le righe presentanti dei valori duplicati dovuti alla scorretta nominazione dell'università.

In [49]:
shanghai_ranking.drop([3425, 3738, 4132,3606,3912,3383,3748,3783,3853,3820,4249,3654,4274,3860,3960,3309], inplace=True)

Scrivo una funzione da applicare esclusivamente a shanghai in quanto alcune problematiche sono sorte solamente in merito ad essa. Tale funzione normalizza le università escludendo i campus non rappresentati la facoltà nella sua interezza. Inoltre, alcune scuole differenti risultano appartenere alla stessa università (es Milano-Bicocca).

In [50]:
def norm_shanghai (value):
    
    
    if value in ['Arizona State University - Tempe','Louisiana State University Health Sciences Center', 'Indiana University-Purdue University at Indianapolis',
                'The University of Connecticut - Storrs','The University of Connecticut Health Center',
                 'University of Arkansas at Little Rock',  'Medical University of Graz',
                 'Medical University of Innsbruck','University of Kansas Medical Center',
                  'University of Maryland, Baltimore','University of Massachusetts Medical School - Worcester']:
        return None
    
    
    for university in school['school_name']:
        if value == university:
            return value
    
        if value == 'The Chinese University of Hong Kong' and university == 'Chinese University of Hong Kong':
            return university
        
        if value == 'University of Milan - Bicocca' and university == 'University of Milan-Bicocca':
            return university
        
        if value == 'University of Wisconsin - Madison' and university == 'University of Wisconsin-Madison':
            return university
        
        if value == 'University of Wisconsin - Milwaukee' and university == 'University of Wisconsin-Milwaukee':
            return university
        
    
    pattern = re.compile(value)
    for university in school['school_name']:
        occurrence = pattern.search(university)
        if occurrence:
            return university
        else:
            pattern2 = re.compile(university)
            occurrence2 = pattern2.search(value)
            if occurrence2:
                return university

Applico la funzione a shanghai.

In [51]:
shanghai_ranking['school_name'] = shanghai_ranking['university_name'].apply(norm_shanghai)

Verifico nuovamente la presenza di valori duplicati nella colonna normalizzata.

In [52]:
shanghai_ranking[(shanghai_ranking['school_name'].isnull()==False) & (shanghai_ranking['school_name'].duplicated()==True)]

Empty DataFrame
Columns: [world_rank, university_name, national_rank, total_score, alumni, award, hici, ns, pub, pcp, year, world_rank_norm, school_name]
Index: []

Normalizzo Times.

In [53]:
times_ranking['school_name'] = times_ranking['university_name'].apply(norm_function)

In [54]:
times_ranking[(times_ranking['school_name'].isnull()==False) & (times_ranking['school_name'].duplicated()==True)]

Empty DataFrame
Columns: [world_rank, university_name, country, teaching, international, research, citations, income, total_score, num_students, student_staff_ratio, international_students, female_male_ratio, year, world_rank_norm, school_name]
Index: []

Normalizzo Cwur il quale presenta come per shanghai alcune problematiche.

In [55]:
cwur_ranking['school_name'] = cwur_ranking['university_name'].apply(norm_function)

Ottengo come in precedenza dei duplicati.

In [56]:
cwur_ranking[(cwur_ranking['school_name'].isnull()==False) & (cwur_ranking['school_name'].duplicated()==True)]

,world_rank,university_name,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year,school_name
2094,895,Nanjing University of Aeronautics and Astronau...,China,61,367,486,218,709,974,812,867.0,853,44.14,2015,Nanjing University
2003,804,Nanjing University of Science and Technology,China,48,367,331,218,796,943,368,826.0,694,44.24,2015,Nanjing University
2009,810,Nanjing University of Technology,China,49,367,567,218,748,984,812,932.0,217,44.22,2015,Nanjing University
2115,916,National Taiwan University of Science and Tech...,Taiwan,15,367,567,218,598,991,812,886.0,823,44.12,2015,National Taiwan University
2070,871,Northeastern University (China),China,55,367,315,218,759,974,812,906.0,698,44.16,2015,Northeastern University
1242,43,"Purdue University, West Lafayette",USA,27,55,33,47,75,95,68,117.0,28,56.39,2015,Purdue University
2168,969,South China Agricultural University,China,73,367,567,218,877,811,812,932.0,871,44.06,2015,China Agricultural University
1476,277,Sun Yat-sen University,China,8,367,254,218,161,393,287,285.0,221,46.25,2015,Sun Yat-sen University
1628,429,University of Arkansas for Medical Sciences,USA,143,367,567,218,501,565,812,344.0,340,45.08,2015,University of Arkansas
631,432,University of Bordeaux I,France,17,355,478,210,327,228,406,361.0,426,45.41,2014,University of Bordeaux
602,403,University of Bordeaux II,France,15,355,478,210,440,385,363,322.0,426,45.54,2014,University of Bordeaux
1783,584,University of Graz,Austria,7,349,453,204,571,547,812,511.0,600,44.54,2015,University of Graz
1692,493,"University of Maryland, Baltimore County",USA,158,367,567,218,587,391,428,402.0,423,44.80,2015,"University of Maryland, Baltimore County"
2024,825,University of Massachusetts Boston,USA,215,367,429,218,846,698,428,796.0,824,44.21,2015,University of Massachusetts
2083,884,University of Massachusetts Lowell,USA,222,367,528,218,936,943,321,946.0,304,44.15,2015,University of Massachusetts
1382,183,University of Massachusetts Medical School,USA,79,367,567,80,296,76,234,122.0,143,47.85,2015,University of Massachusetts
1581,382,University of Milan - Bicocca,Italy,17,367,567,218,390,305,287,324.0,468,45.28,2015,University of Milan
1753,554,University of Missouri–Kansas City,USA,169,311,480,218,634,447,645,471.0,687,44.61,2015,University of Missouri
1947,748,University of Missouri–St. Louis,USA,203,367,371,218,897,524,428,715.0,634,44.30,2015,University of Missouri
1675,476,University of Oklahoma Health Sciences Center,USA,153,367,567,218,580,461,511,375.0,482,44.86,2015,University of Oklahoma
1331,132,University of São Paulo,Brazil,1,297,71,218,59,186,136,164.0,710,49.31,2015,University of São Paulo
1709,510,University of Wisconsin–Milwaukee,USA,161,229,248,218,516,491,511,503.0,871,44.74,2015,University of Wisconsin
2183,984,Zhejiang University of Technology,China,79,367,567,218,858,991,812,958.0,672,44.04,2015,Zhejiang University
1980,781,École Polytechnique de Montréal,Canada,26,367,507,218,716,921,511,741.0,412,44.27,2015,École Polytechnique

Procedo come in precedenza.

In [57]:
cwur_ranking[cwur_ranking['school_name']=='University of Missouri']

,world_rank,university_name,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year,school_name
1393,194,University of Missouri–Columbia,USA,84,250,88,98,222,226,161,242.0,150,47.59,2015,University of Missouri
1753,554,University of Missouri–Kansas City,USA,169,311,480,218,634,447,645,471.0,687,44.61,2015,University of Missouri
1947,748,University of Missouri–St. Louis,USA,203,367,371,218,897,524,428,715.0,634,44.30,2015,University of Missouri

In [58]:
cwur_ranking[cwur_ranking['school_name']=='University of Bordeaux']

,world_rank,university_name,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year,school_name
1498,299,University of Bordeaux,France,14,354,567,218,291,265,234,251.0,297,45.96,2015,University of Bordeaux
631,432,University of Bordeaux I,France,17,355,478,210,327,228,406,361.0,426,45.41,2014,University of Bordeaux
602,403,University of Bordeaux II,France,15,355,478,210,440,385,363,322.0,426,45.54,2014,University of Bordeaux

In [59]:
del cwur_ranking['school_name']

In [60]:
cwur_ranking.head()

,world_rank,university_name,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
1981,782,AGH University of Science and Technology,Poland,4,267,279,218,708,891,511,896.0,398,44.26,2015
1764,565,Aalborg University,Denmark,5,367,439,218,596,660,287,520.0,401,44.59,2015
1620,421,Aalto University,Finland,4,367,224,218,336,403,645,424.0,246,45.10,2015
1321,122,Aarhus University,Denmark,2,310,165,106,91,81,101,95.0,154,49.65,2015
2013,814,Aberystwyth University,United Kingdom,59,367,567,218,842,552,511,754.0,607,44.22,2015

Scrivo la funzione personalizzata per cwur in cui indico i campus secondari o non presenti nel dataset school_country infatti University of Massachussets si presenta in cwur in diverse città. Tuttavia, solo quella residente in Amherst è rappresentativa dello stato. Per questa ragione si decide di non considerare le altre. 
Inoltre, avremmo potuto aggiungere alcune righe al datatset school_country riferite a tutte le univeristà del Massachussets al fine di trovare un collegamento con il dataset cwur e mantenerle nell'analisi.

In [61]:
def norm_world (value):
    
    
    if value in ['University of Bordeaux I', 'University of Bordeaux II', 'Nanjing University of Aeronautics and Astronautics','Nanjing University of Science and Technology','Nanjing University of Technology',
                  'Northeastern University (China)', 'Indiana University-Purdue University Indianapolis',                            
                    'South China Agricultural University','University of Arkansas for Medical Sciences',
                      'Medical University of Graz', 'University of Maryland, Baltimore','University of Massachusetts Boston',
                         'University of Massachusetts Lowell','University of Massachusetts Medical School', 'University of Missouri–Kansas City',
                            'University of Missouri–St. Louis','University of Oklahoma Health Sciences Center',
                            'Federal University of São Paulo','Zhejiang University of Technology', 'École Polytechnique de Montréal']:
        return None
    
    
    for university in school['school_name']:
        if value == university:
            return value
        
        
        if value == 'National Taiwan University of Science and Technology'\
        and university == 'National Taiwan University of Science and Technology (Taiwan Tech)':
            return university
        
        if value == 'National Sun Yat-sen University' and university == 'National Sun Yat-Sen University':
            return university
        
        if value == 'University of Milan - Bicocca' and university == 'University of Milan-Bicocca':
            return university
        
        if value == 'University of Wisconsin–Madison' and university == 'University of Wisconsin-Madison':
            return university
        
        if value == 'University of Wisconsin–Milwaukee' and university == 'University of Wisconsin-Milwaukee':
            return university
        
        
        
    pattern = re.compile(value)
    for university in school['school_name']:
        occurrence = pattern.search(university)
        if occurrence:
            return university
        else:
            pattern2 = re.compile(university)
            occurrence2 =pattern2.search(value)
            if occurrence2:
                return university

In [62]:
cwur_ranking['school_name'] = cwur_ranking['university_name'].apply(norm_world)

In [63]:
cwur_ranking[(cwur_ranking['school_name'].isnull()==False) & (cwur_ranking['school_name'].duplicated()==True)]

Empty DataFrame
Columns: [world_rank, university_name, country, national_rank, quality_of_education, alumni_employment, quality_of_faculty, publications, influence, citations, broad_impact, patents, score, year, school_name]
Index: []

Non considero le righe presentati missing values nella colonna generata con la funzione.

In [64]:
sh_final = shanghai_ranking[shanghai_ranking['school_name'].isnull()==False][['school_name','world_rank_norm']]
sh_final.head()

                               school_name  world_rank_norm
4696                    Aalborg University              350
4796                      Aalto University              450
4468                     Aarhus University               73
3115              Aix-Marseille University              126
4797  Aristotle University of Thessaloniki              450

In [65]:
cwur_final = cwur_ranking[cwur_ranking['school_name'].isnull()==False][['school_name','world_rank']]

In [66]:
tm_final = times_ranking[times_ranking['school_name'].isnull()==False][['school_name','world_rank_norm']]

Unisco i tre dataset, due per volta, mediante la colonna normalizzata.

In [67]:
first_merge= pd.merge(sh_final, tm_final, on='school_name')
first_merge.head()

                            school_name  world_rank_norm_x  world_rank_norm_y
0                    Aalborg University                350                225
1                      Aalto University                450                275
2                     Aarhus University                 73                106
3              Aix-Marseille University                126                275
4  Aristotle University of Thessaloniki                450                700

In [68]:
final_merge = pd.merge(first_merge, cwur_final, on='school_name')
final_merge.head()

,school_name,world_rank_norm_x,world_rank_norm_y,world_rank
0,Aalborg University,350,225,565
1,Aalto University,450,275,421
2,Aarhus University,73,106,122
3,Aix-Marseille University,126,275,206
4,Aristotle University of Thessaloniki,450,700,459

Modifico i nomi delle colonne per chiarezza.

In [69]:
final_merge.rename(columns={'world_rank_norm_x':'shanghai_ranking', 'world_rank_norm_y':'times_ranking', 'world_rank':'cwur_ranking'},inplace=True)
final_merge.head()

,school_name,shanghai_ranking,times_ranking,cwur_ranking
0,Aalborg University,350,225,565
1,Aalto University,450,275,421
2,Aarhus University,73,106,122
3,Aix-Marseille University,126,275,206
4,Aristotle University of Thessaloniki,450,700,459

Scrivo una funzione per calcolare la differenza richiesta dal punto 4.

In [70]:
def max_min_difference(value):
    maximum = max(value['shanghai_ranking'],value['times_ranking'], value['cwur_ranking'])
    minimum = min(value['shanghai_ranking'],value['times_ranking'], value['cwur_ranking'])
    
    return (maximum - minimum)

In [71]:
final_merge['difference'] = final_merge.apply(max_min_difference,axis=1)
final_merge

,school_name,shanghai_ranking,times_ranking,cwur_ranking,difference
0,Aalborg University,350,225,565,340
1,Aalto University,450,275,421,175
2,Aarhus University,73,106,122,49
3,Aix-Marseille University,126,275,206,149
4,Aristotle University of Thessaloniki,450,700,459,250
...,...,...,...,...,...
431,Yale University,11,12,11,1
432,Yeshiva University,250,164,171,86
433,Yonsei University,250,325,98,227
434,York University,450,325,337,125
435,Zhejiang University,125,275,191,150

### 5. Consider only the most recent data point of the *times* dataset. Compute the number of male and female students for each country.

D'ora in poi creerò una copia per ogni dataset utilizzato e per ogni punto del problema.

In [72]:
times5 = times_ranking.copy()
times5.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,world_rank_norm,school_name
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",17.0,1%,-,2016,700,AGH University of Science and Technology
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016,225,Aalborg University
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016,275,Aalto University
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016,106,Aarhus University
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016,325,Aberystwyth University

Noto che nella colonna female_male_ratio sono presenti dei valori '-' che decido di rimuovere.

In [73]:
times5[times5['female_male_ratio'].str.contains('-')==True]

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,world_rank_norm,school_name
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",17.0,1%,-,2016,700,AGH University of Science and Technology
2322,501-600,Czech Technical University in Prague,Czech Republic,20.6,25.0,9.3,46.5,28.2,-,"22,751",12.0,NaN,-,2016,550,Czech Technical University in Prague
2343,501-600,King Fahd University of Petroleum and Minerals,Saudi Arabia,25.4,84.5,16.1,24.4,81.2,-,"6,898",7.1,20%,-,2016,550,King Fahd University of Petroleum and Minerals

In [74]:
times5.drop([2405,2322,2343], inplace=True)

Controllo inoltre nelle colonne di interesse se sono presenti dei missing.

In [75]:
times5['num_students'].isnull().sum()

22

In [76]:
times5['female_male_ratio'].isnull().sum()

76

Decido di rimuoverli e verifico la rimozione.

In [77]:
times5 = times5[times5['num_students'].isnull()==False]
times5[times5['num_students'].isnull()]

Empty DataFrame
Columns: [world_rank, university_name, country, teaching, international, research, citations, income, total_score, num_students, student_staff_ratio, international_students, female_male_ratio, year, world_rank_norm, school_name]
Index: []

In [78]:
times5 = times5[times5['female_male_ratio'].isnull()==False]
times5[times5['female_male_ratio'].isnull()]

Empty DataFrame
Columns: [world_rank, university_name, country, teaching, international, research, citations, income, total_score, num_students, student_staff_ratio, international_students, female_male_ratio, year, world_rank_norm, school_name]
Index: []

Noto anche che le colonne di interesse non sono numeriche.

In [79]:
times5.dtypes

world_rank                 object
university_name            object
country                    object
teaching                  float64
international              object
research                  float64
citations                 float64
income                     object
total_score                object
num_students               object
student_staff_ratio       float64
international_students     object
female_male_ratio          object
year                        int64
world_rank_norm             int64
school_name                object
dtype: object

Rimuovo la virgola al fine di renderle numeriche.

In [80]:
times5['num_students'] = times5['num_students'].str.replace(',','')

In [81]:
times5['num_students'] = times5['num_students'].astype(float)
times5.dtypes

world_rank                 object
university_name            object
country                    object
teaching                  float64
international              object
research                  float64
citations                 float64
income                     object
total_score                object
num_students              float64
student_staff_ratio       float64
international_students     object
female_male_ratio          object
year                        int64
world_rank_norm             int64
school_name                object
dtype: object

Scrivo una funzione che calcola la percentuale di femmine dal numero totale di studenti. I valori female_male sono resi numerici dalla funzione.

In [82]:
def female_perc_calculator(value):
    
    f = int(re.split(':', value['female_male_ratio'])[0])
    students = value['num_students']
    n_female = round((students*f)/100, 0)
    
    return n_female

La applico quindi creando una nuova colonna.

In [83]:
times5['female_number'] = times5.apply(female_perc_calculator, axis=1)
times5.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,world_rank_norm,school_name,female_number
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,17422.0,15.9,15%,48 : 52,2016,225,Aalborg University,8363.0
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099.0,24.2,17%,32 : 68,2016,275,Aalto University,5152.0
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,13.6,14%,54 : 46,2016,106,Aarhus University,12903.0
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,9252.0,19.2,18%,48 : 52,2016,325,Aberystwyth University,4441.0
2404,601-800,Adam Mickiewicz University,Poland,20.0,25.7,11.0,15.3,28.7,-,40633.0,15.6,1%,71 : 29,2016,700,Adam Mickiewicz University,28849.0

Procedo ugualmente per i maschi.

In [84]:
def male_perc_calculator(value):
    
    m = int(re.split(':', value['female_male_ratio'])[1])
    students = value['num_students']
    n_male = round((students*m)/100, 0)
    
    return n_male

In [85]:
times5['male_number'] = times5.apply(male_perc_calculator, axis=1)
times5.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,world_rank_norm,school_name,female_number,male_number
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,17422.0,15.9,15%,48 : 52,2016,225,Aalborg University,8363.0,9059.0
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099.0,24.2,17%,32 : 68,2016,275,Aalto University,5152.0,10947.0
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,13.6,14%,54 : 46,2016,106,Aarhus University,12903.0,10992.0
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,9252.0,19.2,18%,48 : 52,2016,325,Aberystwyth University,4441.0,4811.0
2404,601-800,Adam Mickiewicz University,Poland,20.0,25.7,11.0,15.3,28.7,-,40633.0,15.6,1%,71 : 29,2016,700,Adam Mickiewicz University,28849.0,11784.0

Raggruppo per country, selezionando alcune colonne di interesse e sommando le varie percentuali.

In [86]:
country_ratio = times5.groupby('country')[['country','female_number','male_number']].sum()
country_ratio

                          female_number  male_number
country
Argentina                       67191.0      41182.0
Australia                      391736.0     321640.0
Austria                         68364.0      66113.0
Bangladesh                      21323.0      41393.0
Belarus                         20219.0       9084.0
...                                 ...          ...
Uganda                          18670.0      18670.0
Ukraine                         17846.0      19250.0
United Arab Emirates             9516.0       4931.0
United Kingdom                 711814.0     613028.0
United States of America      1601453.0    1556324.0

[70 rows x 2 columns]

### 6. Find the universities where the ratio between female and male is below the average ratio (computed over all universities)

Considero solamente le colonne utili ai fini del problema dal dataset del punto precedente prima del raggruppamento.

In [87]:
times6 = times5[['university_name','country','female_number','male_number']].copy()
times6.head()

                 university_name         country  female_number  male_number
2003          Aalborg University         Denmark         8363.0       9059.0
2056            Aalto University         Finland         5152.0      10947.0
1908           Aarhus University         Denmark        12903.0      10992.0
2105      Aberystwyth University  United Kingdom         4441.0       4811.0
2404  Adam Mickiewicz University          Poland        28849.0      11784.0

Scrivo un'altra funzione che calcoli il rapporto tra il numero di femmine e maschi.

In [88]:
def compute_ratio(value):
    if  (value['male_number'] == 0):
        return None
    else:
        return round(value['female_number'] / value['male_number'] *100,1)

In [89]:
times6['ratio']=times6.apply(compute_ratio,axis=1)
times6.head()

,university_name,country,female_number,male_number,ratio
2003,Aalborg University,Denmark,8363.0,9059.0,92.3
2056,Aalto University,Finland,5152.0,10947.0,47.1
1908,Aarhus University,Denmark,12903.0,10992.0,117.4
2105,Aberystwyth University,United Kingdom,4441.0,4811.0,92.3
2404,Adam Mickiewicz University,Poland,28849.0,11784.0,244.8

Considero, come da richiesta, solo le università con il rapporto minore del valore medio dello stesso.

In [90]:
univ_below = times6[times6['ratio']<times6['ratio'].mean()]
univ_below

,university_name,country,female_number,male_number,ratio
2003,Aalborg University,Denmark,8363.0,9059.0,92.3
2056,Aalto University,Finland,5152.0,10947.0,47.1
2105,Aberystwyth University,United Kingdom,4441.0,4811.0,92.3
2406,Ajou University,South Korea,4193.0,8513.0,49.3
2408,Alexandria University,Egypt,58618.0,68813.0,85.2
...,...,...,...,...,...
2104,Zhejiang University,China,19478.0,28030.0,69.5
1856,École Normale Supérieure,France,1104.0,1296.0,85.2
2013,École Normale Supérieure de Lyon,France,1087.0,1131.0,96.1
1904,École Polytechnique,France,437.0,1992.0,21.9
1833,École Polytechnique Fédérale de Lausanne,Switzerland,2610.0,7056.0,37.0

### 7. For each country, compute the fraction of the students in the country that are in one of the universities computed in the previous point (that is, the denominator of the ratio is the total number of students over all universities in the country).

Considero il dataset sopra creato.

In [91]:
times7 = univ_below.copy()

Creo una nuova colonna data dalla somma tra le femmine e i maschi.

In [92]:
times7['students_number'] = times7['female_number']+times7['male_number']
times7.head(1)

,university_name,country,female_number,male_number,ratio,students_number
2003,Aalborg University,Denmark,8363.0,9059.0,92.3,17422.0

raggruppo per country sommando i valori.

In [93]:
times7 = times7.groupby('country').sum()
times7.head()

            female_number  male_number  ratio  students_number
country
Australia         69448.0      76787.0  548.3         146235.0
Austria           21935.0      39098.0  257.5          61033.0
Bangladesh        21323.0      41393.0   51.5          62716.0
Brazil           130413.0     148361.0  747.9         278774.0
Canada            41102.0      45676.0  270.5          86778.0

Considero solo la colonna degli studenti totali per paese

In [94]:
times7 = times7['students_number']
times7.head()

country
Australia     146235.0
Austria        61033.0
Bangladesh     62716.0
Brazil        278774.0
Canada         86778.0
Name: students_number, dtype: float64

Ora, recupero il dataset contenente il numero di maschi e femmine per country. calcolo anche per questo il totale di studenti.

In [95]:
country_ratio['tot_students_number'] = country_ratio['female_number'] + country_ratio['male_number']
country_ratio.head(4)

            female_number  male_number  tot_students_number
country
Argentina         67191.0      41182.0             108373.0
Australia        391736.0     321640.0             713376.0
Austria           68364.0      66113.0             134477.0
Bangladesh        21323.0      41393.0              62716.0

In [96]:
tot_students= country_ratio['tot_students_number']
tot_students.head(2)

country
Argentina    108373.0
Australia    713376.0
Name: tot_students_number, dtype: float64

Unisco i due dataset tramite la colonna dei paesi.

In [97]:
country_merged = pd.merge(times7, tot_students, on='country')
country_merged

                          students_number  tot_students_number
country
Australia                        146235.0             713376.0
Austria                           61033.0             134477.0
Bangladesh                        62716.0              62716.0
Brazil                           278774.0             494251.0
Canada                            86778.0             623628.0
Chile                             90951.0              90951.0
China                            885294.0            1015151.0
Colombia                          54645.0              54645.0
Czech Republic                    38685.0             175871.0
Denmark                           45705.0             119355.0
Egypt                            359372.0             376189.0
Estonia                           14061.0              24330.0
Finland                           39788.0             106165.0
France                           156153.0             650488.0
Germany                          435244.0             918502.0
Ghana                             37274.0              37274.0
Greece                            57198.0             202012.0
Hong Kong                         32079.0              80271.0
Hungary                           22447.0              87765.0
India                            155371.0             155371.0
Indonesia                         43565.0              43565.0
Iran                             107280.0             138992.0
Israel                            30550.0              83423.0
Italy                            106470.0            1129166.0
Japan                            447415.0             467844.0
Kenya                             72676.0              72676.0
Lebanon                            7695.0               7695.0
Luxembourg                         5144.0               5144.0
Malaysia                          16270.0             161827.0
Mexico                           151731.0             151731.0
Morocco                           56060.0              56060.0
Netherlands                       58883.0             225877.0
New Zealand                       12187.0             125957.0
Nigeria                           26247.0              26247.0
Norway                            17381.0              39402.0
Oman                               7088.0               7088.0
Pakistan                           9808.0              22496.0
Poland                            59789.0             225313.0
Portugal                          89285.0             163890.0
Republic of Ireland               34597.0              90116.0
Russian Federation               119356.0             208613.0
Singapore                         56620.0              56620.0
Slovakia                          16400.0              37279.0
South Korea                      276058.0             293683.0
Spain                            136088.0             830331.0
Sweden                            20668.0             132623.0
Switzerland                       34692.0             118976.0
Taiwan                           209949.0             296951.0
Thailand                          66058.0             210122.0
Turkey                           216017.0             639342.0
Uganda                            37340.0              37340.0
Ukraine                           22686.0              37096.0
United Arab Emirates               5226.0              14447.0
United Kingdom                   259977.0            1324842.0
United States of America        1726342.0            3157777.0

Calcolo il rapporto tra il numero di studenti riferiti ai due datatset.

In [98]:
country_merged['ratio'] = round((country_merged['students_number']/country_merged['tot_students_number'])*100,2)
country_merged

                          students_number  tot_students_number   ratio
country
Australia                        146235.0             713376.0   20.50
Austria                           61033.0             134477.0   45.39
Bangladesh                        62716.0              62716.0  100.00
Brazil                           278774.0             494251.0   56.40
Canada                            86778.0             623628.0   13.92
Chile                             90951.0              90951.0  100.00
China                            885294.0            1015151.0   87.21
Colombia                          54645.0              54645.0  100.00
Czech Republic                    38685.0             175871.0   22.00
Denmark                           45705.0             119355.0   38.29
Egypt                            359372.0             376189.0   95.53
Estonia                           14061.0              24330.0   57.79
Finland                           39788.0             106165.0   37.48
France                           156153.0             650488.0   24.01
Germany                          435244.0             918502.0   47.39
Ghana                             37274.0              37274.0  100.00
Greece                            57198.0             202012.0   28.31
Hong Kong                         32079.0              80271.0   39.96
Hungary                           22447.0              87765.0   25.58
India                            155371.0             155371.0  100.00
Indonesia                         43565.0              43565.0  100.00
Iran                             107280.0             138992.0   77.18
Israel                            30550.0              83423.0   36.62
Italy                            106470.0            1129166.0    9.43
Japan                            447415.0             467844.0   95.63
Kenya                             72676.0              72676.0  100.00
Lebanon                            7695.0               7695.0  100.00
Luxembourg                         5144.0               5144.0  100.00
Malaysia                          16270.0             161827.0   10.05
Mexico                           151731.0             151731.0  100.00
Morocco                           56060.0              56060.0  100.00
Netherlands                       58883.0             225877.0   26.07
New Zealand                       12187.0             125957.0    9.68
Nigeria                           26247.0              26247.0  100.00
Norway                            17381.0              39402.0   44.11
Oman                               7088.0               7088.0  100.00
Pakistan                           9808.0              22496.0   43.60
Poland                            59789.0             225313.0   26.54
Portugal                          89285.0             163890.0   54.48
Republic of Ireland               34597.0              90116.0   38.39
Russian Federation               119356.0             208613.0   57.21
Singapore                         56620.0              56620.0  100.00
Slovakia                          16400.0              37279.0   43.99
South Korea                      276058.0             293683.0   94.00
Spain                            136088.0             830331.0   16.39
Sweden                            20668.0             132623.0   15.58
Switzerland                       34692.0             118976.0   29.16
Taiwan                           209949.0             296951.0   70.70
Thailand                          66058.0             210122.0   31.44
Turkey                           216017.0             639342.0   33.79
Uganda                            37340.0              37340.0  100.00
Ukraine                           22686.0              37096.0   61.15
United Arab Emirates               5226.0              14447.0   36.17
United Kingdom                   259977.0            1324842.0   19.62
United States of America        1726342.0            3157777.0   54.67

### 8. Read the file `educational_attainment_supplementary_data.csv`, discarding any row with missing `country_name` or `series_name`

Importo il dataset indicato.

In [138]:
educ = pd.read_csv('educational_attainment_supplementary_data.csv')
educ

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
79050,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
79051,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
79052,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
79053,Data from database: Education Statistics: Educ...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
79054,Last Updated: 10/20/2015,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Mostro le righe con valori mancanti.

In [137]:
educ[((educ['country_name'].isnull()== True) | (educ['series_name'].isnull()==True))]

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
79050,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
79051,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
79052,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
79053,Data from database: Education Statistics: Educ...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
79054,Last Updated: 10/20/2015,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Eseguo la richiesta.

In [139]:
educ = educ[~((educ['country_name'].isnull()== True) | (educ['series_name'].isnull()==True))]
educ

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
79045,Zimbabwe,UIS: Percentage of population age 25+ with som...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,13.84323,NaN,NaN
79046,Zimbabwe,UIS: Percentage of population age 25+ with som...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,16.68491,NaN,NaN
79047,Zimbabwe,UIS: Percentage of population age 25+ with unk...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,11.99412,NaN,NaN
79048,Zimbabwe,UIS: Percentage of population age 25+ with unk...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5.77150,NaN,NaN
79049,Zimbabwe,UIS: Percentage of population age 25+ with unk...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,9.14588,NaN,NaN

### 9. From `attainment` build a dataframe with the same data, but with 4 columns: `country_name`, `series_name`, `year`, `value`

In [100]:
educ.head()

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN,NaN

In [331]:
educ.columns

Index(['country_name', 'series_name', '1985', '1986', '1987', '1990', '1991',
       '1992', '1993', '1995', '1996', '1997', '1998', '1999', '2000', '2001',
       '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013', '2015'],
      dtype='object')

Utilizzo il comando pd.melt per passare dal formato wide a long quindi comprimendo le colonne degli anni in un'unica e creando un'ulteriore colonna per i valori riferiti agli anni stessi.

In [140]:
pd.melt(educ, id_vars=['country_name','series_name'], value_vars=['1985', '1986', '1987', '1990', '1991',
       '1992', '1993', '1995', '1996', '1997', '1998', '1999', '2000', '2001',
       '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013', '2015'], var_name ='year', value_name ='value')

,country_name,series_name,year,value
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,0.33
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,1.03
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,0.83
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,2.34
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,0.54
...,...,...,...,...
2134345,Zimbabwe,UIS: Percentage of population age 25+ with som...,2015,NaN
2134346,Zimbabwe,UIS: Percentage of population age 25+ with som...,2015,NaN
2134347,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2015,NaN
2134348,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2015,NaN
2134349,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2015,NaN

### 10. For each university, find the number of rankings in which they appear (it suffices to appear in one year for each ranking).

In [102]:
times10 = times.copy()
shanghai10 = shanghai.copy()
cwur10 = cwur.copy()

Per il problema in esame normalizzo nuovamente con le funzioni del punto 4 senza eliminare i duplicati.

In [104]:
times10['normalized_name'] = times10['university_name'].apply(norm_function)

In [105]:
times10.head(1)

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,world_rank_norm,normalized_name
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011,1,Harvard University

In [106]:
shanghai10['normalized_name'] = shanghai10['university_name'].apply(norm_shanghai)

In [107]:
shanghai10.head(1)

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,world_rank_norm,normalized_name
0,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005,1,Harvard University

In [108]:
cwur10['normalized_name'] = cwur10['university_name'].apply(norm_world)

In [109]:
cwur10.head(1)

,world_rank,university_name,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year,normalized_name
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.0,2012,Harvard University

Non considero i missing values.

In [110]:
shanghai10 = shanghai10[shanghai10['normalized_name'].isnull()==False]

In [111]:
times10 = times10[times10['normalized_name'].isnull()==False]
times10.head(1)

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,world_rank_norm,normalized_name
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011,1,Harvard University

In [112]:
cwur10 = cwur10[cwur10['normalized_name'].isnull()==False]
cwur10.head(1)

,world_rank,university_name,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year,normalized_name
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.0,2012,Harvard University

Prendo una lista delle università normalizzate per ogni dataset considerando i valori univoci. Dopodichè le concatento in un'unica lista.

In [113]:
times_list = list(times10['normalized_name'].unique())
shanghai_list = list(shanghai10['normalized_name'].unique())
cwur_list = list(cwur10['normalized_name'].unique())

In [114]:
concat_list = times_list + shanghai_list + cwur_list

Importo la funzione Counter che conta quante volte un determinato valore sia presente internamente alla lista creando un dizionario che associa il numero di volte. Lo applico quindi alla lista prima creata.

In [115]:
from collections import Counter

In [116]:
diz=Counter(concat_list)
diz

Counter({'Harvard University': 3,
         'California Institute of Technology': 3,
         'Massachusetts Institute of Technology': 3,
         'Stanford University': 3,
         'Princeton University': 3,
         'University of Cambridge': 3,
         'University of Oxford': 3,
         'University of California, Berkeley': 3,
         'Imperial College London': 2,
         'Yale University': 3,
         'University of California, Los Angeles': 3,
         'University of Chicago': 3,
         'Johns Hopkins University': 3,
         'Cornell University': 3,
         'ETH Zurich – Swiss Federal Institute of Technology Zurich': 2,
         'University of Michigan': 3,
         'University of Toronto': 3,
         'Columbia University': 3,
         'University of Pennsylvania': 3,
         'Carnegie Mellon University': 3,
         'University of Hong Kong': 3,
         'University College London': 3,
         'University of Washington': 3,
         'Duke University': 3,
         'Northwestern University': 3,
         'University of Tokyo': 3,
         'Georgia Institute of Technology': 3,
         'Pohang University of Science and Technology': 3,
         'University of California, Santa Barbara': 3,
         'University of British Columbia': 3,
         'University of North Carolina at Chapel Hill': 3,
         'University of California, San Diego': 3,
         'University of Illinois at Urbana-Champaign': 2,
         'National University of Singapore': 3,
         'McGill University': 3,
         'University of Melbourne': 3,
         'Peking University': 3,
         'Washington University in St Louis': 1,
         'École Polytechnique': 2,
         'University of Edinburgh': 3,
         'Hong Kong University of Science and Technology': 3,
         'École Normale Supérieure': 1,
         'Australian National University': 3,
         'Karolinska Institute': 3,
         'University of Göttingen': 2,
         'University of Wisconsin': 1,
         'Rice University': 3,
         'École Polytechnique Fédérale de Lausanne': 1,
         'University of California, Irvine': 3,
         'University of Science and Technology of China': 3,
         'Vanderbilt University': 3,
         'University of Minnesota': 3,
         'Tufts University': 3,
         'University of California, Davis': 3,
         'Brown University': 3,
         'University of Massachusetts': 3,
         'Kyoto University': 3,
         'Tsinghua University': 3,
         'Boston University': 3,
         'New York University': 3,
         'Emory University': 3,
         'LMU Munich': 1,
         'University of Notre Dame': 3,
         'University of Pittsburgh': 3,
         'Case Western Reserve University': 3,
         'Ohio State University': 3,
         'University of Colorado Boulder': 2,
         'University of Bristol': 3,
         'University of California, Santa Cruz': 3,
         'Yeshiva University': 3,
         'University of Sydney': 3,
         'University of Virginia': 3,
         'University of Adelaide': 3,
         'University of Southern California': 3,
         'William & Mary': 1,
         'Trinity College Dublin': 2,
         'King’s College London': 1,
         'Stony Brook University': 3,
         'Korea Advanced Institute of Science and Technology (KAIST)': 3,
         'University of Sussex': 3,
         'The University of Queensland': 3,
         'University of York': 3,
         'Heidelberg University': 2,
         'University of Utah': 3,
         'Durham University': 3,
         'London School of Economics and Political Science': 3,
         'University of Manchester': 3,
         'Royal Holloway, University of London': 2,
         'Lund University': 3,
         'University of Southampton': 3,
         'University of Zurich': 3,
         'Wake Forest University': 3,
         'McMaster University': 3,
         'University College Dublin': 3,
         'George Washington University': 3,
         'University of Arizona': 3,
         'University of Basel': 3,
         'University of Maryland, College Park': 3,
         'Dartmouth College': 3,
         'École Normale Supérieure de Lyon': 1,
         'Technical University of Munich': 3,
         'University of Helsinki': 3,
         'University of St Andrews': 3,
         'Rensselaer Polytechnic Institute': 3,
         'Rutgers, the State University of New Jersey': 1,
         'Purdue University': 3,
         'National Tsing Hua University': 3,
         'University of Cape Town': 3,
         'Pennsylvania State University': 3,
         'Seoul National University': 3,
         'Hong Kong Baptist University': 2,
         'Bilkent University': 2,
         'Tokyo Institute of Technology': 3,
         'Eindhoven University of Technology': 3,
         'National Taiwan University': 3,
         'University of Hawai’i at Mānoa': 1,
         'University of California, Riverside': 3,
         'University of Geneva': 3,
         'KU Leuven': 2,
         'Nanjing University': 3,
         'Queen Mary University of London': 3,
         'Michigan State University': 3,
         'Technical University of Denmark': 3,
         'Ghent University': 3,
         'Lancaster University': 3,
         'Leiden University': 3,
         'University of Alberta': 3,
         'University of Glasgow': 3,
         'Stockholm University': 3,
         'Osaka University': 3,
         'University of Victoria': 3,
         'Tohoku University': 3,
         'University of Freiburg': 3,
         'University of Iowa': 3,
         'University of Bergen': 3,
         'University of Lausanne': 3,
         'University of Sheffield': 3,
         'University of Montreal': 3,
         'VU University Amsterdam': 3,
         'Pierre and Marie Curie University': 1,
         'University of Dundee': 3,
         'University of Barcelona': 3,
         'Utrecht University': 3,
         'Wageningen University and Research Center': 1,
         'University of Auckland': 3,
         'University of Birmingham': 3,
         'Alexandria University': 2,
         'Uppsala University': 3,
         'Hong Kong Polytechnic University': 3,
         'University of Aberdeen': 3,
         'Delft University of Technology': 3,
         'Birkbeck, University of London': 3,
         'Newcastle University': 3,
         'University of New South Wales': 3,
         'Pompeu Fabra University': 3,
         'Indiana University': 3,
         'Iowa State University': 3,
         'Georgia Health Sciences University': 1,
         'Erasmus University Rotterdam': 3,
         'University of Delaware': 3,
         'Arizona State University': 3,
         'Boston College': 3,
         'National Sun Yat-Sen University': 3,
         'Georgetown University': 3,
         'University of Amsterdam': 3,
         'University of Liverpool': 3,
         'Aarhus University': 3,
         'University of Leeds': 3,
         'University of Würzburg': 2,
         'University of Groningen': 3,
         'Sun Yat-sen University': 3,
         'Goethe University Frankfurt': 2,
         'Bielefeld University': 3,
         'Nanyang Technological University': 3,
         'University of East Anglia': 3,
         'University of Nottingham': 3,
         'University of Copenhagen': 3,
         'Humboldt University of Berlin': 2,
         'Monash University': 3,
         'University of Bonn': 3,
         'National Chiao Tung University': 3,
         'RWTH Aachen University': 3,
         'Middle East Technical University': 2,
         'University of Exeter': 3,
         'University of Twente': 3,
         'University of Konstanz': 3,
         'Karlsruhe Institute of Technology': 3,
         'University of Innsbruck': 3,
         'University of Tübingen': 2,
         'Drexel University': 3,
         'University of Cincinnati': 3,
         'Yonsei University': 3,
         'Dalhousie University': 3,
         'KTH Royal Institute of Technology': 3,
         'University of Vienna': 3,
         'Kent State University': 3,
         'University of Illinois at Chicago': 3,
         'Zhejiang University': 3,
         'Simon Fraser University': 3,
         'Swedish University of Agricultural Sciences': 3,
         'University of Wisconsin-Madison': 3,
         'University of Texas at Austin': 3,
         'University of Rochester': 3,
         'University of Bern': 3,
         'Hebrew University of Jerusalem': 3,
         'University of Florida': 3,
         'Brandeis University': 3,
         'Chinese University of Hong Kong': 3,
         'Free University of Berlin': 2,
         'University of Warwick': 3,
         'Radboud University Nijmegen': 3,
         'Medical University of South Carolina': 3,
         'Texas A&M University': 3,
         'University of Reading': 3,
         'Tel Aviv University': 3,
         'Paris Diderot University – Paris 7': 1,
         'Université Catholique de Louvain': 1,
         'University of Miami': 3,
         'Queen’s University': 1,
         'University of São Paulo': 2,
         'University of Oslo': 3,
         'University of Ottawa': 3,
         'University of Western Australia': 3,
         'City University of Hong Kong': 3,
         'Maastricht University': 3,
         'University of Leicester': 3,
         'Autonomous University of Barcelona': 3,
         'Cardiff University': 3,
         'Colorado School of Mines': 2,
         'Nagoya University': 3,
         'Northeastern University': 3,
         'Technion Israel Institute of Technology': 1,
         'Tulane University': 3,
         'Ulm University': 1,
         'Umeå University': 2,
         'University at Buffalo': 3,
         'University of Essex': 3,
         'University of Georgia': 3,
         'University of Gothenburg': 3,
         'University of Medicine and Dentistry of New Jersey': 1,
         'University of Otago': 3,
         'University of South Carolina': 3,
         'University of Strasbourg': 3,
         'University of Waterloo': 3,
         'University of Western Ontario': 3,
         'Université Libre de Bruxelles': 1,
         'Carleton University': 3,
         'Chalmers University of Technology': 3,
         'Colorado State University': 3,
         'Creighton University': 2,
         'Fudan University': 3,
         'Korea University': 3,
         'Macquarie University': 3,
         'State University of New York Albany': 1,
         'Tokyo Metropolitan University': 3,
         'University of Bologna': 3,
         'University of Calgary': 3,
         'University of Hamburg': 3,
         'University of Milan': 3,
         'University of Milan-Bicocca': 3,
         'University of Missouri': 3,
         'University of Padua': 3,
         'University of Trieste': 3,
         'Bangor University': 3,
         'Brunel University London': 3,
         'Johannes Kepler University of Linz': 2,
         'Kyushu University': 3,
         'Norwegian University of Science and Technology': 3,
         'Queen’s University Belfast': 1,
         'Ruhr University Bochum': 2,
         'Stellenbosch University': 3,
         'Tilburg University': 3,
         'TU Dresden': 2,
         'University of Bath': 3,
         'University of Graz': 3,
         'University of Kiel': 3,
         'University of Southern Denmark': 3,
         'University of Texas at Dallas': 3,
         'University of the Witwatersrand': 3,
         'University of Tsukuba': 3,
         'University of Wollongong': 3,
         'Victoria University of Wellington': 3,
         'Virginia Polytechnic Institute and State University': 3,
         'Wayne State University': 3,
         'Aberystwyth University': 2,
         'Autonomous University of Madrid': 3,
         'Hokkaido University': 3,
         'Istanbul Technical University': 2,
         'Lomonosov Moscow State University': 3,
         'Montpellier University': 1,
         'Queensland University of Technology': 3,
         'State University of Campinas': 3,
         'Technical University of Darmstadt': 1,
         'Tokyo Medical and Dental University (TMDU)': 3,
         'UiT The Arctic University of Norway': 1,
         'University of Antwerp': 3,
         'University of Crete': 2,
         'University of Guelph': 3,
         'University of Iceland': 2,
         'University of Kansas': 3,
         'University of Kentucky': 3,
         'University of Münster': 2,
         'University of Newcastle': 3,
         'University of Texas at San Antonio': 3,
         'University of Trento': 2,
         'York University': 3,
         'Aalborg University': 3,
         'Aalto University': 3,
         'Bar-Ilan University': 3,
         'Binghamton University, State University of New York': 2,
         'Boğaziçi University': 2,
         'Charles Darwin University': 2,
         'Charles University in Prague': 3,
         'George Mason University': 3,
         'Indian Institute of Technology Bombay': 2,
         'Jagiellonian University': 3,
         'Keele University': 2,
         'Keio University': 3,
         'Lehigh University': 3,
         'Linköping University': 2,
         'National Taiwan University of Science and Technology (Taiwan Tech)': 2,
         'Plymouth University': 2,
         'Polytechnic University of Milan': 2,
         'Sapienza University of Rome': 3,
         'Shanghai Jiao Tong University': 3,
         'Sharif University of Technology': 3,
         'Sungkyunkwan University (SKKU)': 3,
         'University College Cork': 3,
         'University of Aveiro': 2,
         'University of Canterbury': 3,
         'University of Eastern Finland': 3,
         'University of Ferrara': 3,
         'University of Hertfordshire': 3,
         'University of Houston': 3,
         'University of Hull': 2,
         'University of Liège': 2,
         'University of Manitoba': 3,
         'University of Maryland, Baltimore County': 3,
         'University of Modena and Reggio Emilia': 2,
         'University of Oklahoma': 3,
         'University of Pisa': 3,
         'University of Porto': 3,
         'University of South Florida': 3,
         'University of Stirling': 2,
         'University of Surrey': 3,
         'University of Tampere': 2,
         'University of Tasmania': 3,
         'University of Valencia': 3,
         'University of Waikato': 2,
         'University of Warsaw': 3,
         'Vienna University of Technology': 3,
         'Vrije Universiteit Brussel': 3,
         'Washington State University': 3,
         'Aston University': 2,
         'Auburn University': 3,
         'Clemson University': 3,
         'Curtin University': 3,
         'Deakin University': 3,
         'Flinders University': 3,
         'Georgia State University': 2,
         'Griffith University': 3,
         'Harbin Institute of Technology': 3,
         'Heriot-Watt University': 2,
         'Hiroshima University': 3,
         'Kansas State University': 3,
         'Kobe University': 3,
         'Kyung Hee University': 3,
         'La Trobe University': 3,
         'Leibniz University of Hanover': 2,
         'Liverpool John Moores University': 2,
         'Loughborough University': 3,
         'Mahidol University': 2,
         'Massey University': 3,
         'Michigan Technological University': 3,
         'National Central University': 3,
         'National Taiwan Ocean University': 2,
         'National University of Ireland, Galway': 2,
         'National University of Ireland, Maynooth': 2,
         'New Jersey Institute of Technology': 3,
         'New University of Lisbon': 1,
         'Old Dominion University': 3,
         'Polytechnic University of Catalonia': 3,
         'Polytechnic University of Turin': 3,
         'Polytechnic University of Valencia': 3,
         'Pontifical Catholic University of Chile': 3,
         'Saint Petersburg State University': 3,
         'Swansea University': 3,
         'Swinburne University of Technology': 3,
         'Tokyo University of Agriculture and Technology': 3,
         'University of Bari Aldo Moro': 3,
         'University of Coimbra': 3,
         'University of Idaho': 3,
         'University of Kent': 2,
         'University of Paris North – Paris 13': 1,
         'University of Salento': 2,
         'University of South Australia': 2,
         'University of Strathclyde': 3,
         'University of Tartu': 2,
         'University of Turku': 3,
         'University of Wyoming': 3,
         'University of Zaragoza': 3,
         'Waseda University': 3,
         'Wuhan University': 3,
         'Yuan Ze University': 2,
         'Paris-Sud University': 1,
         'Joseph Fourier University': 3,
         'Johannes Gutenberg University of Mainz': 3,
         'St George’s, University of London': 1,
         'University of Erlangen-Nuremberg': 3,
         'Florida Institute of Technology': 2,
         'Indian Institute of Technology Kharagpur': 3,
         'Koç University': 1,
         'Laval University': 3,
         'Mines ParisTech': 2,
         'National Research Nuclear University MePhI': 1,
         'University of Connecticut': 3,
         'University of Oregon': 3,
         'Bayreuth University': 1,
         'Oregon State University': 3,
         'University of Montana': 3,
         'University of Turin': 3,
         'Claude Bernard University Lyon 1': 3,
         'King Abdulaziz University': 3,
         'Medical University of Vienna': 3,
         'Murdoch University': 3,
         'National Cheng Kung University': 3,
         'North Carolina State University': 3,
         'Renmin University of China': 2,
         'University of Fribourg': 3,
         'University of Pavia': 3,
         'University of Portsmouth': 2,
         'University of Vermont': 3,
         'Indian Institute of Technology Roorkee': 2,
         'King Mongkut’s University of Technology Thonburi': 1,
         'National Autonomous University of Mexico': 3,
         'Paris Dauphine University': 2,
         'Southern Methodist University': 3,
         'Temple University': 3,
         'University of Duisburg-Essen': 3,
         'University of Jyväskylä': 2,
         'University of KwaZulu-Natal': 3,
         'University of Minho': 2,
         'University of Technology Sydney': 1,
         'University of the Andes, Colombia': 1,
         'University of Vigo': 3,
         'Panjab University': 2,
         'University of Cologne': 2,
         'University of Nebraska-Lincoln': 1,
         'University of Alaska Fairbanks': 2,
         'Wuhan University of Technology': 2,
         'China Medical University, Taiwan': 2,
         'Hanyang University': 3,
         'Indian Institute of Technology Delhi': 2,
         'Indian Institute of Technology Kanpur': 2,
         'King Saud University': 3,
         'San Diego State University': 3,
         'University of Florence': 3,
         'University of Navarra': 2,
         'University of Rovira i Virgili': 1,
         'Scuola Normale Superiore di Pisa': 2,
         'Syracuse University': 3,
         'Sabancı University': 1,
         'Technical University of Berlin': 3,
         'Federico Santa María Technical University': 2,
         'University of Bremen': 3,
         'University of New Mexico': 3,
         'Indian Institute of Science': 3,
         'Lappeenranta University of Technology': 1,
         'University of Macau': 1,
         'Illinois Institute of Technology': 2,
         'Novosibirsk State University': 2,
         'University of Marrakech Cadi Ayyad': 1,
         'University of Nebraska Medical Center': 3,
         'University of Stuttgart': 3,
         'Ewha Womans University': 3,
         'Isfahan University of Technology': 2,
         'Royal College of Surgeons in Ireland': 2,
         'University of Lisbon': 3,
         'University of Rome III': 1,
         'University of Seoul': 2,
         'Western Sydney University': 1,
         'University of Mannheim': 2,
         'Scuola Superiore Sant’Anna': 1,
         'University of Luxembourg': 1,
         'Charité - Universitätsmedizin Berlin': 1,
         'Copenhagen Business School': 1,

### 11. In the times ranking, compute the number of times each university appears

In [117]:
times11 = times.copy()

Prendo una lista delle università nel dataset Times e la ordino alfabeticamente.

In [118]:
university_list = list(times11['university_name'])

In [119]:
university_list.sort()

Applico nuovamente la funzione Counter.

In [120]:
a = Counter(university_list)
a

Counter({'AGH University of Science and Technology': 1,
         'Aalborg University': 5,
         'Aalto University': 5,
         'Aarhus University': 6,
         'Aberystwyth University': 5,
         'Adam Mickiewicz University': 1,
         'Aix-Marseille University': 1,
         'Ajou University': 1,
         'Alexandria University': 3,
         'Alexandru Ioan Cuza University': 1,
         'Aligarh Muslim University': 1,
         'American University': 1,
         'American University of Beirut': 1,
         'American University of Sharjah': 1,
         'Amirkabir University of Technology': 1,
         'Amrita University': 1,
         'Anadolu University': 1,
         'Andhra University': 1,
         'Aristotle University of Thessaloniki': 1,
         'Arizona State University': 6,
         'Asia University, Taiwan': 1,
         'Aston University': 3,
         'Athens University of Economics and Business': 1,
         'Auburn University': 2,
         'Auckland University of Technology': 1,
         'Austral University of Chile': 1,
         'Australian National University': 6,
         'Autonomous University of Barcelona': 5,
         'Autonomous University of Madrid': 5,
         'Babeş-Bolyai University': 1,
         'Bangor University': 5,
         'Bar-Ilan University': 2,
         'Bauman Moscow State Technical University': 1,
         'Bayreuth University': 4,
         'Beijing Institute of Technology': 1,
         'Belarusian State University': 1,
         'Ben-Gurion University of the Negev': 1,
         'Bielefeld University': 6,
         'Bilkent University': 6,
         'Binghamton University, State University of New York': 3,
         'Birkbeck, University of London': 6,
         'Birla Institute of Technology and Science, Pilani': 1,
         'Blaise Pascal University': 1,
         'Boston College': 6,
         'Boston University': 6,
         'Bournemouth University': 1,
         'Boğaziçi University': 5,
         'Brandeis University': 5,
         'Brno University of Technology': 1,
         'Brown University': 6,
         'Brunel University London': 5,
         'Budapest University of Technology and Economics': 1,
         'Cairo University': 1,
         'California Institute of Technology': 6,
         'California State University, Long Beach': 1,
         'Capital Medical University': 1,
         'Cardiff University': 5,
         'Carleton University': 5,
         'Carlos III University of Madrid': 1,
         'Carnegie Mellon University': 6,
         'Case Western Reserve University': 6,
         'Catholic University of the Sacred Heart': 1,
         'Ca’ Foscari University of Venice': 1,
         'Central Queensland University': 1,
         'Chalmers University of Technology': 5,
         'Chang Gung University': 1,
         'Charité - Universitätsmedizin Berlin': 1,
         'Charles Darwin University': 5,
         'Charles University in Prague': 5,
         'Chiang Mai University': 1,
         'Chiba University': 1,
         'China Agricultural University': 1,
         'China Medical University, Taiwan': 2,
         'China University of Geosciences (Wuhan)': 1,
         'China University of Petroleum (Beijing)': 1,
         'Chinese University of Hong Kong': 5,
         'Chonbuk National University': 1,
         'Chongqing University': 1,
         'Chonnam National University': 1,
         'Chulalongkorn University': 1,
         'Chung Yuan Christian University': 1,
         'Chung-Ang University': 1,
         'Chungnam National University': 1,
         'City University London': 1,
         'City University of Hong Kong': 5,
         'Claude Bernard University Lyon 1': 4,
         'Clemson University': 2,
         'Colorado School of Mines': 5,
         'Colorado State University': 5,
         'Columbia University': 6,
         'Comenius University in Bratislava': 1,
         'Complutense University of Madrid': 1,
         'Concordia University': 1,
         'Copenhagen Business School': 1,
         'Cornell University': 6,
         'Coventry University': 1,
         'Creighton University': 4,
         'Curtin University': 3,
         'Czech Technical University in Prague': 1,
         'Dalhousie University': 6,
         'Dalian University of Technology': 1,
         'Dartmouth College': 6,
         'De Montfort University': 1,
         'Deakin University': 5,
         'Delft University of Technology': 6,
         'Drexel University': 6,
         'Dublin City University': 1,
         'Dublin Institute of Technology': 1,
         'Duke University': 6,
         'Durham University': 6,
         'ETH Zurich – Swiss Federal Institute of Technology Zurich': 6,
         'East China Normal University': 1,
         'East China University of Science and Technology': 1,
         'Edith Cowan University': 1,
         'Ehime University': 1,
         'Eindhoven University of Technology': 6,
         'Emory University': 6,
         'Erasmus University Rotterdam': 6,
         'Erciyes University': 1,
         'Ewha Womans University': 2,
         'Eötvös Loránd University': 1,
         'Federal University of Bahia': 1,
         'Federal University of Lavras': 1,
         'Federal University of Minas Gerais': 1,
         'Federal University of Paraná (UFPR)': 1,
         'Federal University of Rio Grande do Sul': 1,
         'Federal University of Rio de Janeiro': 1,
         'Federal University of Santa Catarina': 1,
         'Federal University of São Carlos': 1,
         'Federal University of Viçosa': 1,
         'Federico Santa María Technical University': 2,
         'Feng Chia University': 1,
         'Flinders University': 3,
         'Florida Institute of Technology': 4,
         'Florida International University': 1,
         'Florida State University': 1,
         'Free University of Berlin': 5,
         'Fu Jen Catholic University': 1,
         'Fudan University': 5,
         'Gdańsk University of Technology': 1,
         'George Mason University': 5,
         'George Washington University': 6,
         'Georgetown University': 6,
         'Georgia Health Sciences University': 4,
         'Georgia Institute of Technology': 6,
         'Georgia State University': 2,
         'Ghent University': 6,
         'Gifu University': 1,
         'Glasgow Caledonian University': 1,
         'Goethe University Frankfurt': 6,
         'Graz University of Technology': 1,
         'Griffith University': 2,
         'Gwangju Institute of Science and Technology': 1,
         'Hacettepe University': 1,
         'Hanyang University': 3,
         'Harbin Institute of Technology': 2,
         'Harvard University': 6,
         'Hebrew University of Jerusalem': 5,
         'Heidelberg University': 6,
         'Heriot-Watt University': 4,
         'Hiroshima University': 2,
         'Hokkaido University': 5,
         'Hong Kong Baptist University': 6,
         'Hong Kong Polytechnic University': 6,
         'Hong Kong University of Science and Technology': 6,
         'Howard University': 1,
         'Huazhong University of Science and Technology': 1,
         'Humboldt University of Berlin': 6,
         'Hunan University': 1,
         'I-Shou University': 1,
         'Illinois Institute of Technology': 1,
         'Imperial College London': 6,
         'Indian Institute of Science': 2,
         'Indian Institute of Technology Bombay': 4,
         'Indian Institute of Technology Delhi': 2,
         'Indian Institute of Technology Guwahati': 1,
         'Indian Institute of Technology Kanpur': 2,
         'Indian Institute of Technology Kharagpur': 3,
         'Indian Institute of Technology Madras': 1,
         'Indian Institute of Technology Roorkee': 4,
         'Indiana University': 6,
         'Inha University': 1,
         'Instituto Superior Técnico Lisboa': 1,
         'Iowa State University': 6,
         'Iran University of Science and Technology': 1,
         'Isfahan University of Technology': 2,
         'Istanbul Technical University': 5,
         'Istanbul University': 1,
         'Jadavpur University': 1,
         'Jagiellonian University': 3,
         'James Cook University': 1,
         'Jilin University': 1,
         'Johannes Gutenberg University of Mainz': 2,
         'Johannes Kepler University of Linz': 4,
         'Johns Hopkins University': 6,
         'Jordan University of Science and Technology': 1,
         'Joseph Fourier University': 4,
         'Juntendo University': 1,
         'Justus Liebig University Giessen': 1,
         'K.N. Toosi University of Technology': 1,
         'KTH Royal Institute of Technology': 6,
         'KU Leuven': 6,
         'Kanazawa University': 1,
         'Kansas State University': 4,
         'Kaohsiung Medical University': 1,
         'Karlsruhe Institute of Technology': 6,
         'Karolinska Institute': 6,
         'Kazan Federal University': 1,
         'Keele University': 4,
         'Keio University': 3,
         'Kent State University': 3,
         'Khon Kaen University': 1,
         'King Abdulaziz University': 3,
         'King Fahd University of Petroleum and Minerals': 1,
         'King Mongkut’s University of Technology Thonburi': 4,
         'King Saud University': 2,
         'Kingston University': 1,
         'King’s College London': 6,
         'Kinki University': 1,
         'Kobe University': 2,
         'Konkuk University': 1,
         'Korea Advanced Institute of Science and Technology (KAIST)': 6,
         'Korea University': 5,
         'Koç University': 4,
         'Kumamoto University': 1,
         'Kyoto University': 6,
         'Kyung Hee University': 2,
         'Kyungpook National University': 1,
         'Kyushu Institute of Technology': 1,
         'Kyushu University': 5,
         'LMU Munich': 6,
         'La Trobe University': 2,
         'Lancaster University': 6,
         'Lappeenranta University of Technology': 2,
         'Laval University': 4,
         'Lehigh University': 5,
         'Leibniz University of Hanover': 4,
         'Leiden University': 6,
         'Lille 1 University – Science and Technology': 1,
         'Lille 2 University – Health and Law': 1,
         'Linköping University': 5,
         'Liverpool John Moores University': 3,
         'Lomonosov Moscow State University': 5,
         'London School of Economics and Political Science': 6,
         'Loughborough University': 4,
         'Louisiana State University': 1,
         'Lund University': 6,
         'Maastricht University': 5,
         'Macquarie University': 5,
         'Mahidol University': 2,
         'Makerere University': 1,
         'Manchester Metropolitan University': 1,
         'Marche Polytechnic University': 1,
         'Masaryk University': 1,
         'Massachusetts Institute of Technology': 6,
         'Massey University': 3,
         'McGill University': 6,
         'McMaster University': 6,
         'Medical College of Wisconsin': 1,
         'Medical University of South Carolina': 2,
         'Medical University of Vienna': 4,
         'Memorial University of Newfoundland': 1,
         'Miami University': 1,
         'Michigan State University': 6,
         'Michigan Technological University': 1,
         'Middle East Technical University': 6,
         'Middlesex University': 1,
         'Mines ParisTech': 3,
         'Missouri University of Science and Technology': 1,
         'Monash University': 6,
         'Montana State University': 1,
         'Monterrey Institute of Technology and Higher Education': 1,
         'Montpellier University': 5,
         'Moscow Institute of Physics and Technology': 1,
         'Murdoch University': 4,
         'Nagasaki University': 1,
         'Nagoya University': 5,
         'Nanjing University': 6,
         'Nanyang Technological University': 6,
         'National Autonomous University of Mexico': 2,
         'National Central University': 4,
         'National Cheng Kung University': 4,
         'National Chengchi University': 1,
         'National Chiao Tung University': 6,
         'National Chung Cheng University': 1,
         'National Chung Hsing University': 1,
         'National Institute of Applied Sciences of Lyon (INSA Lyon)': 1,
         'National Research Nuclear University MePhI': 2,
         'National Sun Yat-Sen University': 6,
         'National Taipei University of Technology': 1,
         'National Taiwan Normal University': 1,
         'National Taiwan Ocean University': 2,
         'National Taiwan University': 6,
         'National Taiwan University of Science and Technology (Taiwan Tech)': 5,
         'National Technical University of Athens': 1,
         'National Tsing Hua University': 6,
         'National University of Córdoba': 1,
         'National University of Ireland, Galway': 5,
         'National University of Ireland, Maynooth': 4,
         'National University of Science and Technology (MISiS)': 1,
         'National University of Sciences and Technology': 1,
         'National University of Singapore': 6,
         'National Yang-Ming University': 1,
         'National and Kapodistrian University of Athens': 1,
         'New Jersey Institute of Technology': 2,
         'New Mexico State University': 1,
         'New University of Lisbon': 2,
         'New York University': 6,
         'Newcastle University': 6,
         'Niigata University': 1,
         'North Carolina State University': 2,
         'Northeastern University': 5,
         'Northumbria University': 1,
         'Northwestern Polytechnical University': 1,
         'Northwestern University': 6,
         'Norwegian University of Science and Technology': 5,
         'Nottingham Trent University': 1,
         'Novosibirsk State University': 2,
         'Oakland University': 1,
         'Ocean University of China': 1,
         'Ohio State University': 6,
         'Ohio University': 1,
         'Okayama University': 1,
         'Oklahoma State University': 1,
         'Old Dominion University': 2,
         'Oregon Health and Science University': 1,
         'Oregon State University': 4,
         'Osaka City University': 1,
         'Osaka Prefecture University': 1,
         'Osaka University': 6,
         'Otto von Guericke University of Magdeburg': 1,
         'Oxford Brookes University': 1,
         'Palacký University in Olomouc': 1,
         'Panjab University': 3,
         'Panthéon-Sorbonne University – Paris 1': 1,
         'Paris Dauphine University': 2,
         'Paris Descartes University': 1,
         'Paris Diderot University – Paris 7': 5,
         'Paris-Sorbonne University – Paris 4': 1,
         'Paris-Sud University': 4,
         'Peking University': 6,
         'Pennsylvania State University': 6,
         'Peter the Great St Petersburg Polytechnic University': 1,
         'Pierre and Marie Curie University': 6,
         'Plymouth University': 4,
         'Pohang University of Science and Technology': 6,
         'Polytechnic University of Catalonia': 2,
         'Polytechnic University of Milan': 5,
         'Polytechnic University of Turin': 2,
         'Polytechnic University of Valencia': 4,
         'Pompeu Fabra University': 6,
         'Pontifical Catholic University of Chile': 2,
         'Pontifical Catholic University of Paraná': 1,
         'Pontifical Catholic University of Rio Grande do Sul (PUCRS)': 1,
         'Pontifical Catholic University of Rio de Janeiro (PUC-Rio)': 1,
         'Pontifical Catholic University of Valparaíso': 1,
         'Portland State University': 1,
         'Prince of Songkla University': 1,
         'Princeton University': 6,
         'Purdue University': 6,
         'Pusan National University': 1,
         'Qatar University': 1,
         'Quaid-i-azam University': 1,
         'Queen Mary University of London': 6,
         'Queensland University of Technology': 5,
         'Queen’s University': 5,
         'Queen’s University Belfast': 5,
         'RMIT University': 1,
         'RWTH Aachen University': 6,
         'Radboud University Nijmegen': 5,
         'Renmin University of China': 4,
         'Rensselaer Polytechnic Institute': 6,
         'Rice University': 6,
         'Rio de Janeiro State University (UERJ)': 1,
         'Rochester Institute of Technology': 1,
         'Royal College of Surgeons in Ireland': 2,
         'Royal Holloway, University of London': 6,
         'Royal Veterinary College': 1,
         'Ruhr University Bochum': 5,
         'Rush University': 1,
         'Rutgers, the State University of New Jersey': 6,
         'Sabancı University': 2,
         'Saint Louis University': 1,
         'Saint Petersburg State University': 2,
         'Saitama University': 1,
         'San Diego State University': 3,
         'Sapienza University of Rome': 5,
         'Savitribai Phule Pune University': 1,
         'Scuola Normale Superiore di Pisa': 2,
         'Scuola Superiore Sant’Anna': 1,
         'Sejong University': 1,
         'Semmelweis University': 1,
         'Seoul National University': 6,
         'Shahid Beheshti University': 1,
         'Shanghai Jiao Tong University': 5,
         'Shanghai University': 1,
         'Shantou University': 1,
         'Sharif University of Technology': 5,
         'Sheffield Hallam University': 1,
         'Shinshu University': 1,
         'Showa University': 1,
         'Sichuan University': 1,
         'Simon Fraser University': 6,
         'Slovak University of Technology in Bratislava': 1,
         'Sogang University': 1,
         'Soochow University': 1,
         'Sophia University': 1,
         'South China University of Technology': 1,
         'Southern Cross University': 1,
         'Southern Federal University': 1,
         'Southern Methodist University': 1,
         'St George’s, University of London': 4,
         'Stanford University': 6,
         'State University of Campinas': 5,
         'State University of New York Albany': 5,
         'Stellenbosch University': 5,
         'Stockholm University': 6,
         'Stony Brook University': 6,
         'Suez Canal University': 1,
         'Sultan Qaboos University': 1,
         'Sun Yat-sen University': 6,
         'Sungkyunkwan University (SKKU)': 5,
         'Suranaree University of Technology': 1,
         'Swansea University': 2,
         'Swedish University of Agricultural Sciences': 6,
         'Swinburne University of Technology': 4,
         'Syracuse University': 2,
         'São Paulo State University (UNESP)': 1,
         'TU Dresden': 5,
         'Taipei Medical University': 1,
         'Tallinn University of Technology': 1,
         'Tampere University of Technology': 1,
         'Taras Shevchenko National University of Kyiv': 1,
         'Technical University of Berlin': 1,
         'Technical University of Darmstadt': 5,
         'Technical University of Denmark': 6,
         'Technical University of Dortmund': 1,
         'Technical University of Madrid': 1,
         'Technical University of Munich': 6,
         'Technion Israel Institute of Technology': 5,
         'Tehran University of Medical Sciences': 1,
         'Tel Aviv University': 5,
         'Temple University': 3,
         'Texas A&M University': 5,
         'Texas Tech University': 1,
         'The Open University': 1,
         'The University of Queensland': 6,
         'Tianjin University': 1,
         'Tilburg University': 5,
         'Tohoku University': 6,
         'Tokai University': 1,
         'Tokushima University': 1,
         'Tokyo Institute of Technology': 6,
         'Tokyo Medical and Dental University (TMDU)': 5,
         'Tokyo Metropolitan University': 5,
         'Tokyo University of Agriculture and Technology': 2,
         'Tokyo University of Marine Science and Technology': 1,
         'Tokyo University of Science': 1,
         'Tomsk Polytechnic University': 1,
         'Tomsk State University': 1,
         'Tongji University': 1,
         'Tottori University': 1,
         'Toulouse 1 Capitole University': 1,

Creo un dataset dal dizionario selezionando solo le colonne util perchè necessario al punto successivo.

In [121]:
tab = pd.DataFrame(a.items(), columns=['university_name', 'number_of_times'])
tab

                              university_name  number_of_times
0    AGH University of Science and Technology                1
1                          Aalborg University                5
2                            Aalto University                5
3                           Aarhus University                6
4                      Aberystwyth University                5
..                                        ...              ...
813                  École Normale Supérieure                6
814          École Normale Supérieure de Lyon                6
815                       École Polytechnique                6
816  École Polytechnique Fédérale de Lausanne                6
817                         Örebro University                1

[818 rows x 2 columns]

### 12. Find the universities that appear at most twice in the times ranking.

In [122]:
tab[tab['number_of_times']<=2]

                              university_name  number_of_times
0    AGH University of Science and Technology                1
5                  Adam Mickiewicz University                1
6                    Aix-Marseille University                1
7                             Ajou University                1
9              Alexandru Ioan Cuza University                1
..                                        ...              ...
806                  Yokohama City University                1
807              Yokohama National University                1
810                        Yuan Ze University                2
811               Yıldız Technical University                1
817                         Örebro University                1

[408 rows x 2 columns]

### 13. The universities that, in any year, have the same position in all three rankings (they must have the same position in a year).

In [127]:
times13 = times10.copy()
cwur13 = cwur10.copy()
shanghai13 = shanghai10.copy()

Rimuovo come fatto in precedenza il simbolo uguale.

In [128]:
times13['world_rank']=times13['world_rank'].str.replace('=','')
times13.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,world_rank_norm,normalized_name
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011,1,Harvard University
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011,2,California Institute of Technology
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011,3,Massachusetts Institute of Technology
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011,4,Stanford University
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,-,94.2,"7,929",8.4,27%,45 : 55,2011,5,Princeton University

Rimuovo anche le righe presentanti il trattino per la colonna world_rank in shanghai e times le quali rappresentano le università con ranking definito come range.

In [129]:
shanghai13 = shanghai13[shanghai13['world_rank'].str.contains('-')==False]
times13 = times13[times13['world_rank'].str.contains('-')==False]

Seleziono le colonne di interesse per i tre dataset.

In [130]:
shanghai_restricted = shanghai13[['normalized_name','year','world_rank']]
times_restricted = times13[['normalized_name','year','world_rank']]
cwur_restricted = cwur13[['normalized_name','year','world_rank']]

Li unisco due a due cambiando i nomi delle colonne.

In [131]:
merge1 = pd.merge(shanghai_restricted, times_restricted, on=['normalized_name','year'])
ultimate_merge = pd.merge(merge1, cwur_restricted,on=['normalized_name','year'])

In [132]:
ultimate_merge.rename(columns={'world_rank_x':'shanghai_ranking','world_rank_y':'times_ranking','world_rank':'cwur_ranking'},inplace = True)
ultimate_merge

,normalized_name,year,shanghai_ranking,times_ranking,cwur_ranking
0,Harvard University,2012,1,2,1
1,Stanford University,2012,2,2,3
2,Massachusetts Institute of Technology,2012,3,7,2
3,"University of California, Berkeley",2012,4,10,10
4,University of Cambridge,2012,5,6,4
...,...,...,...,...,...
283,McMaster University,2015,96,94,150
284,University of Bonn,2015,97,195,158
285,VU University Amsterdam,2015,98,136,129
286,Michigan State University,2015,99,82,118
287,Texas A&M University,2015,100,141,102

Converto a numero le colonne su cui devo operare.

In [133]:
ultimate_merge['cwur_ranking'] = ultimate_merge['cwur_ranking'].astype(int)
ultimate_merge['shanghai_ranking'] = ultimate_merge['shanghai_ranking'].astype(int)
ultimate_merge['times_ranking'] = ultimate_merge['times_ranking'].astype(int)
ultimate_merge.dtypes

normalized_name     object
year                 int64
shanghai_ranking     int32
times_ranking        int32
cwur_ranking         int32
dtype: object

Verifico a questro punto la presenza di università con lo stesso ranking per i tre dataset.

In [134]:
ultimate_merge[(ultimate_merge['shanghai_ranking']==ultimate_merge['times_ranking']) & (ultimate_merge['times_ranking']==ultimate_merge['cwur_ranking'])]

        normalized_name  year  shanghai_ranking  times_ranking  cwur_ranking
69  Stanford University  2013                 2              2             2

THE END